import type { PgBaseSchema, INTEGER_PG, VARCHAR50_PG, VARCHAR_PG, SMALLINT_PG, VARCHAR255_PG } from "../../_/db.pg";
import type { _Owner } from "../stream-user/schema";

/** 账簿记录的类型
 * @ToB_Sale 根据销售单-签立合同（借）应收账款 100w（贷）主营业务收入 87w 应交税费 13w
 * @ToB_Sale 根据发货单-发出货物（借）主营业务成本 60w（贷）库存商品 60w
 * @ToB_Sale 根据多笔收款记录-合计收到货款（借）基本存款账户 100w（贷）应收账款 100w
 * @ToB_Sale 根据多笔发票记录-合计开出发票，仅仅（贷）主营业务收入（已开发票）13w
 * 
 * @ToC_Sale 根据销售单-签立合同（借）应收账款 6k（贷）其他业务收入 6k
 * @ToC_Sale 根据发货单-发出货物（借）其他业务成本 5k（贷）库存商品 5k
 * @ToC_Sale 根据多笔收款记录-合计收到货款（借）一般存款账户 6k（贷）应收账款 6k
 */
export enum ENUM_BOOK_TYPE {

    /** 基本存款账户，是税务机关核查企业经营收入的主要来源）*/
    CUN_KUAN_ZHANG_HU_JI_BEN = 1002101,

    /** 一般存款账户，是存款人因借款或其他结算需要而开设的资金账户）*/
    CUN_KUAN_ZHANG_HU_YI_BAN = 1002201,

    /** 应收账款（对公） */
    YING_SHOU_ZHANG_KUAN_DAN_WEI = 1122101,

    /** 应收账款（个人） */
    YING_SHOU_ZHANG_KUAN_GE_REN = 1122201,

    /** 应付账款（对公） */
    YING_FU_ZHANG_KUAN_DAN_WEI = 2202101,

    /** 应付账款（个人） */
    YING_FU_ZHANG_KUAN_GE_REN = 2202201,

    // ================================================================================
    // ================================================================================
    // ================================================================================
    // ================================================================================
    // ================================================================================

    KU_CUN_SHANG_PIN = 1405101,

    // ================================================================================
    // ================================================================================
    // ================================================================================
    // ================================================================================
    // ================================================================================

    /** 主营业务收入 */
    ZHU_YING_YE_WU_SHOU_RU = 6001101,

    /** 主营业务成本 */
    ZHU_YING_YE_WU_CHENG_BEN = 6401101,

    /** 主营业务收入（已经开票） */
    ZHU_YING_YE_WU_SHOU_RU_TAX = 6001102,

    /** 主营业务成本（已经收票） */
    ZHU_YING_YE_WU_CHENG_BEN_TAX = 6401102,

    /** 其他业务收入 */
    QI_TA_YE_WU_SHOU_RU = 6051101,

    /** 其他业务成本 */
    QI_TA_YE_WU_CHENG_BEN = 6402101,
}

/** 账簿记录的借贷方向 */
export enum ENUM_BOOK_DIRECTION {
    JIE = 1000,
    DAI = 2000,
}

/** 某笔交易涉及的账簿记录
 * @uuid 保证每次记账，都能达到借贷平衡
 * @step1 确实有了收款单、发票后，才需要登记某笔交易需要入账多少金额
*/
export type PondTradeBook = PgBaseSchema & _Owner & {
    tradeId: INTEGER_PG;
    uuid: VARCHAR50_PG

    type: ENUM_BOOK_TYPE;
    direction: ENUM_BOOK_DIRECTION;
    amount: INTEGER_PG
}

/** 某笔交易涉及的账簿记录的合计
 * @step1 确实有了收款单、发票后，才需要登记某笔交易需要入账多少金额
 * @step2 需要知道某笔交易，某个科目余额是多少
 * @step3 然后就能知道这笔交易，还应该回款多少，还应该开多少发票
 */
export type PondTradeBookSummary = PondTradeBook